Autodesk.Revit.DB.Structure.StructuralConnectionsProviderData.AddConnectionTypeGuid(System.Guid)
Adds GUID of the type available for the Connection.
It does not check whether the array already contains given guid,
it is up to the caller to make sure there are no duplicates in the array.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionsProviderData.GetConnectionTypeGuids
Returns the list of guids of available Connection types.
Returns:
Strings representing guids of available connection types.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionsProviderData.AddConnectionMatchType(Autodesk.Revit.DB.Structure.StructuralConnectionMatchType)
Adds the information about the type available for the Connection.
It does not check whether the array already contains given guid,
it is up to the caller to make sure there are no duplicates in the array.
matchType:
The object containing information about the type available for the Connection.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionsProviderData.GetConnectionMatchTypes
Returns the list of items with information about types available for the Connection.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionsProviderData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.StructuralConnectionsProviderData.ConnectionId
Id of Connection Handler element.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionsProviderData.Document
The document.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionsProviderData.#ctor(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Constructs a new instance of StructuralConnectionsProviderData.
document:
The document.
connectionId:
The Id of Connection Handler element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionsProviderData.#ctor
Constructs a new instance of StructuralConnectionsProviderData.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionsProviderData
The data needed by Structural Connections Provider server to return a list of available connection types.
Remarks:
It's exposed in internal API.
Since:
2017